nxp-mcuxpresso/mcux-devices-mcx/MCXA/MCXA256/iar/startup_MCXA256.s
        PUBWEAK SLCD_IRQHandler
        PUBWEAK SLCD_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SLCD_IRQHandler
        LDR     R0, =SLCD_DriverIRQHandler
        BX      R0

Reserved16_DriverIRQHandler
CMC_DriverIRQHandler
DMA_CH0_DriverIRQHandler
DMA_CH1_DriverIRQHandler
DMA_CH2_DriverIRQHandler
DMA_CH3_DriverIRQHandler
DMA_CH4_DriverIRQHandler
DMA_CH5_DriverIRQHandler
DMA_CH6_DriverIRQHandler
DMA_CH7_DriverIRQHandler
ERM0_SINGLE_BIT_DriverIRQHandler
ERM0_MULTI_BIT_DriverIRQHandler
FMU0_DriverIRQHandler
GLIKEY0_DriverIRQHandler
MBC0_DriverIRQHandler
SCG0_DriverIRQHandler
SPC0_DriverIRQHandler
TDET_DriverIRQHandler
WUU0_DriverIRQHandler
CAN0_DriverIRQHandler
CAN1_DriverIRQHandler
Reserved37_DriverIRQHandler
Reserved38_DriverIRQHandler
FLEXIO_DriverIRQHandler
I3C0_DriverIRQHandler
Reserved41_DriverIRQHandler
LPI2C0_DriverIRQHandler
LPI2C1_DriverIRQHandler
LPSPI0_DriverIRQHandler
LPSPI1_DriverIRQHandler
Reserved46_DriverIRQHandler
LPUART0_DriverIRQHandler
LPUART1_DriverIRQHandler
LPUART2_DriverIRQHandler
LPUART3_DriverIRQHandler
LPUART4_DriverIRQHandler
USB0_DriverIRQHandler
Reserved53_DriverIRQHandler
CDOG0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
CTIMER2_DriverIRQHandler
CTIMER3_DriverIRQHandler
CTIMER4_DriverIRQHandler
FLEXPWM0_RELOAD_ERROR_DriverIRQHandler
FLEXPWM0_FAULT_DriverIRQHandler
FLEXPWM0_SUBMODULE0_DriverIRQHandler
FLEXPWM0_SUBMODULE1_DriverIRQHandler
FLEXPWM0_SUBMODULE2_DriverIRQHandler
FLEXPWM0_SUBMODULE3_DriverIRQHandler
EQDC0_COMPARE_DriverIRQHandler
EQDC0_HOME_DriverIRQHandler
EQDC0_WATCHDOG_DriverIRQHandler
EQDC0_INDEX_DriverIRQHandler
FREQME0_DriverIRQHandler
LPTMR0_DriverIRQHandler
Reserved72_DriverIRQHandler
OS_EVENT_DriverIRQHandler
WAKETIMER0_DriverIRQHandler
UTICK0_DriverIRQHandler
WWDT0_DriverIRQHandler
Reserved77_DriverIRQHandler
ADC0_DriverIRQHandler
ADC1_DriverIRQHandler
CMP0_DriverIRQHandler
CMP1_DriverIRQHandler
CMP2_DriverIRQHandler
DAC0_DriverIRQHandler
Reserved84_DriverIRQHandler
Reserved85_DriverIRQHandler
Reserved86_DriverIRQHandler
GPIO0_DriverIRQHandler
GPIO1_DriverIRQHandler
GPIO2_DriverIRQHandler
GPIO3_DriverIRQHandler
GPIO4_DriverIRQHandler
Reserved92_DriverIRQHandler
LPI2C2_DriverIRQHandler
LPI2C3_DriverIRQHandler
FLEXPWM1_RELOAD_ERROR_DriverIRQHandler
FLEXPWM1_FAULT_DriverIRQHandler
FLEXPWM1_SUBMODULE0_DriverIRQHandler
FLEXPWM1_SUBMODULE1_DriverIRQHandler
FLEXPWM1_SUBMODULE2_DriverIRQHandler
FLEXPWM1_SUBMODULE3_DriverIRQHandler
EQDC1_COMPARE_DriverIRQHandler
EQDC1_HOME_DriverIRQHandler
EQDC1_WATCHDOG_DriverIRQHandler
EQDC1_INDEX_DriverIRQHandler
Reserved105_DriverIRQHandler
Reserved106_DriverIRQHandler
Reserved107_DriverIRQHandler
Reserved108_DriverIRQHandler
Reserved109_DriverIRQHandler
Reserved110_DriverIRQHandler
LPUART5_DriverIRQHandler
Reserved112_DriverIRQHandler
Reserved113_DriverIRQHandler
Reserved114_DriverIRQHandler
Reserved115_DriverIRQHandler
Reserved116_DriverIRQHandler
Reserved117_DriverIRQHandler
Reserved118_DriverIRQHandler
Reserved119_DriverIRQHandler
Reserved120_DriverIRQHandler
Reserved121_DriverIRQHandler
Reserved122_DriverIRQHandler
MAU_DriverIRQHandler
SMARTDMA_DriverIRQHandler
CDOG1_DriverIRQHandler
PKC_DriverIRQHandler
SGI_DriverIRQHandler
Reserved128_DriverIRQHandler
TRNG0_DriverIRQHandler
Reserved130_DriverIRQHandler
Reserved131_DriverIRQHandler
ADC2_DriverIRQHandler
ADC3_DriverIRQHandler
Reserved134_DriverIRQHandler
RTC_DriverIRQHandler
RTC_1HZ_DriverIRQHandler
SLCD_DriverIRQHandler
DefaultISR
        B .

        END
